driver-tests/bpelse/misc/MiscJbi/test/ClientService/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://localhost/ClientService_Invoke/ClientProcess">
  <soapenv:Body>
    <cli:simplestring>
      <cli:string>Hello</cli:string>
    </cli:simplestring>
  </soapenv:Body>
</soapenv:Envelope>
